#### Handling Missing Data

In [1]:
import numpy as np
import pandas as pd

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [6]:
from numpy import nan as NA

data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data = pd.DataFrame([[1, 6.5, 3], [1, NA, NA],
                    [NA, NA, NA], [NA, 6.5, 3]])

In [9]:
cleaned = data.dropna()

In [10]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [12]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data[4] = NA

In [14]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [15]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.349687       NaN       NaN
1 -0.093651       NaN       NaN
2 -1.140322       NaN -0.662683
3 -0.233377       NaN  0.909762
4  1.386433  1.405508 -1.171644
5  1.276486 -0.012367 -0.515594
6 -2.394619 -0.845037  1.564451

In [17]:
df.dropna()

          0         1         2
4  1.386433  1.405508 -1.171644
5  1.276486 -0.012367 -0.515594
6 -2.394619 -0.845037  1.564451

In [18]:
df.dropna(thresh=3)

          0         1         2
4  1.386433  1.405508 -1.171644
5  1.276486 -0.012367 -0.515594
6 -2.394619 -0.845037  1.564451

In [19]:
df.fillna(0)

          0         1         2
0 -0.349687  0.000000  0.000000
1 -0.093651  0.000000  0.000000
2 -1.140322  0.000000 -0.662683
3 -0.233377  0.000000  0.909762
4  1.386433  1.405508 -1.171644
5  1.276486 -0.012367 -0.515594
6 -2.394619 -0.845037  1.564451

In [20]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.349687  0.500000  0.000000
1 -0.093651  0.500000  0.000000
2 -1.140322  0.500000 -0.662683
3 -0.233377  0.500000  0.909762
4  1.386433  1.405508 -1.171644
5  1.276486 -0.012367 -0.515594
6 -2.394619 -0.845037  1.564451

In [21]:
_ = df.fillna(0, inplace=True)

In [22]:
df

          0         1         2
0 -0.349687  0.000000  0.000000
1 -0.093651  0.000000  0.000000
2 -1.140322  0.000000 -0.662683
3 -0.233377  0.000000  0.909762
4  1.386433  1.405508 -1.171644
5  1.276486 -0.012367 -0.515594
6 -2.394619 -0.845037  1.564451

In [23]:
df = pd.DataFrame(np.random.randn(6, 3))

df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.637799  0.353154  0.152210
1 -0.745220  0.198164 -1.558319
2 -0.409187       NaN -0.334069
3 -0.492440       NaN -0.692884
4  0.880251       NaN       NaN
5  0.260324       NaN       NaN

In [24]:
df.fillna(method='ffill')

          0         1         2
0 -0.637799  0.353154  0.152210
1 -0.745220  0.198164 -1.558319
2 -0.409187  0.198164 -0.334069
3 -0.492440  0.198164 -0.692884
4  0.880251  0.198164 -0.692884
5  0.260324  0.198164 -0.692884

In [25]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.637799  0.353154  0.152210
1 -0.745220  0.198164 -1.558319
2 -0.409187  0.198164 -0.334069
3 -0.492440  0.198164 -0.692884
4  0.880251       NaN -0.692884
5  0.260324       NaN -0.692884

In [26]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [27]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

#### Data Transformation

In [28]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [29]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [30]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [31]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [32]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [33]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                             'Pastrami', 'corned beef', 'Bacon',
                             'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [34]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [35]:
lowercased = data['food'].str.lower()

In [36]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [37]:
data['animal'] = lowercased.map(meat_to_animal)

In [38]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [39]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [40]:
data = pd.Series([1, -999, 2, -999, -1000, 3])
data

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: int64

In [41]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [42]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [43]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [44]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), index=['Ohio', 'Colorado', 'New York'],
                   columns=['one', 'two', 'three', 'four'])

In [45]:
transform = lambda x: x[:4].upper()

In [46]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [47]:
data.index = data.index.map(transform)

In [48]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [49]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [50]:
data.rename(index={'OHIO': 'INDIANA'},
           columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [51]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [52]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [53]:
ages = [20, 22, 25, 27, 21, 23, 37, 61, 45, 41, 32]

In [54]:
bins = [18, 25, 35, 60, 100]

In [55]:
cats = pd.cut(ages, bins)

In [56]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (35, 60], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 11
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [57]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 3, 2, 2, 1], dtype=int8)

In [58]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [59]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     2
(60, 100]    1
dtype: int64

In [60]:
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [35, 60), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 11
Categories (4, interval[int64]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [63]:
group_names = ['Youth', 'YouthAdult', 'MiddleAged', 'Senior']

pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YouthAdult, Youth, ..., MiddleAged, Senior, MiddleAged, MiddleAged, YouthAdult]
Length: 11
Categories (4, object): [Youth < YouthAdult < MiddleAged < Senior]

In [69]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.26, 0.49], (0.49, 0.72], (0.72, 0.94], (0.032, 0.26], (0.032, 0.26], ..., (0.49, 0.72], (0.72, 0.94], (0.72, 0.94], (0.49, 0.72], (0.032, 0.26]]
Length: 20
Categories (4, interval[float64]): [(0.032, 0.26] < (0.26, 0.49] < (0.49, 0.72] < (0.72, 0.94]]

In [70]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4)
cats

[(0.697, 3.173], (0.00555, 0.697], (0.00555, 0.697], (-0.656, 0.00555], (0.00555, 0.697], ..., (-0.656, 0.00555], (-0.656, 0.00555], (0.697, 3.173], (0.697, 3.173], (-3.449, -0.656]]
Length: 1000
Categories (4, interval[float64]): [(-3.449, -0.656] < (-0.656, 0.00555] < (0.00555, 0.697] < (0.697, 3.173]]

In [71]:
pd.value_counts(cats)

(0.697, 3.173]       250
(0.00555, 0.697]     250
(-0.656, 0.00555]    250
(-3.449, -0.656]     250
dtype: int64

In [72]:
cats = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1])
cats

[(0.00555, 1.307], (0.00555, 1.307], (0.00555, 1.307], (-1.194, 0.00555], (0.00555, 1.307], ..., (-1.194, 0.00555], (-1.194, 0.00555], (0.00555, 1.307], (1.307, 3.173], (-1.194, 0.00555]]
Length: 1000
Categories (4, interval[float64]): [(-3.449, -1.194] < (-1.194, 0.00555] < (0.00555, 1.307] < (1.307, 3.173]]

In [73]:
pd.value_counts(cats)

(0.00555, 1.307]     400
(-1.194, 0.00555]    400
(1.307, 3.173]       100
(-3.449, -1.194]     100
dtype: int64